tap 'adoptopenjdk/openjdk'
tap 'anomalyco/tap'
tap 'boldsoftware/tap'
tap 'clojure/tools'
tap 'homebrew/bundle'
tap 'homebrew/services'
tap 'openfga/tap'
tap 'productdevbook/tap'
tap 'pulumi/tap'
tap 'supabase/tap'
tap 'svix/svix'
tap 'tw93/tap'

brew 'awscli'
brew 'bore-cli'
brew 'buf'
brew 'clang-format'
brew 'cmake'
brew 'cocoapods'
brew 'deno'
brew 'fd'
brew 'ffmpeg'
brew 'flyctl'
brew 'freerdp'
brew 'fswatch'
brew 'gcc'
brew 'gh'
brew 'ghostscript'
brew 'grip'
brew 'go'
brew 'htop'
brew 'httpie'
brew 'hugo'
brew 'imagemagick'
brew 'just'
brew 'libimobiledevice'
brew 'llvm'
brew 'mas'
brew 'opam'
brew 'overmind'
brew 'parallel'
brew 'pgvector'
brew 'pipx'
brew 'poppler'
brew 'postgresql@14'
brew 'postgresql@17'
brew 'protobuf'
brew 'protoc-gen-doc'
brew 'python@3.11'
brew 'ruby-build'
brew 'rbenv'
brew 'redis'
brew 'ripgrep'
brew 'rust-analyzer'
brew 'starship'
brew 'supabase'
brew 'swift-protobuf'
brew 'tectonic'
brew 'tldr'
brew 'tokei'
brew 'tree'
brew 'typst'
brew 'uv'
brew 'volta'
brew 'wasmer'
brew 'websocat'
brew 'wget'
brew 'xcodegen'
brew 'yt-dlp'
brew 'zig'
brew 'zls'
brew 'anomalyco/tap/opencode'
brew 'clojure/tools/clojure'
brew 'pulumi/tap/pulumi'
brew 'svix/svix/svix-cli'
brew 'tw93/tap/mole'

cask '1password'
cask 'adoptopenjdk8'
cask 'alcove'
cask 'android-studio'
cask 'bruno'
cask 'calibre'
cask 'chatgpt'
cask 'claude'
cask 'codex-app'
cask 'conductor'
cask 'cursor'
cask 'dbeaver-community'
cask 'discord'
cask 'docker-desktop'
cask 'firefox'
cask 'font-iosevka'
cask 'fork'
cask 'ghostty'
cask 'google-chrome'
cask 'jordanbaird-ice'
cask 'loom'
cask 'mattermost'
cask 'microsoft-auto-update'
cask 'microsoft-excel'
cask 'microsoft-powerpoint'
cask 'microsoft-teams'
cask 'microsoft-word'
cask 'netnewswire'
cask 'ngrok'
cask 'nordvpn'
cask 'obs'
cask 'obsidian'
cask 'ollama-app'
cask 'pgadmin4'
cask 'portkiller'
cask 'raycast'
cask 'sf-symbols'
cask 'signal'
cask 'slack'
cask 'spotify'
cask 'telegram'
cask 'utm'
cask 'visual-studio-code'
cask 'vlc'
cask 'windows-app'
cask 'xquartz'
cask 'zen'
cask 'zoom'

mas "1Password for Safari", id: 1569813296
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "WhatsApp", id: 310633997
mas "Xcode", id: 497799835
