tap 'clojure/tools'
tap 'pulumi/tap'
tap 'svix/svix'
tap 'tw93/tap'

brew 'aom'
brew 'awscli'
brew 'buf'
brew 'clang-format'
brew 'cmake'
brew 'coreutils'
brew 'cocoapods'
brew 'deno'
brew 'fd'
brew 'ffmpeg'
brew 'fluid-synth'
brew 'flyctl'
brew 'freerdp'
brew 'fswatch'
brew 'gcc'
brew 'gh'
brew 'gmp'
brew 'ghostscript'
brew 'grip'
brew 'harfbuzz'
brew 'go'
brew 'htop'
brew 'httpie'
brew 'hugo'
brew 'imagemagick'
brew 'jpeg-xl'
brew 'just'
brew 'libheif'
brew 'libimobiledevice'
brew 'llvm'
brew 'mas'
brew 'mint'
brew 'opam'
brew 'openjpeg'
brew 'overmind'
brew 'pango'
brew 'parallel'
brew 'pgvector'
brew 'pipx'
brew 'poppler'
brew 'postgresql@14'
brew 'postgresql@17'
brew 'protobuf'
brew 'protoc-gen-doc'
brew 'python@3.11'
brew 'ruby-build'
brew 'rbenv'
brew 'redis'
brew 'ripgrep'
brew 'rust-analyzer'
brew 'starship'
brew 'supabase'
brew 'swift-protobuf'
brew 'tectonic'
brew 'tldr'
brew 'tokei'
brew 'tree'
brew 'typst'
brew 'uv'
brew 'mise'
brew 'vercel-cli'
brew 'wasmer'
brew 'webp'
brew 'websocat'
brew 'wget'
brew 'xcodegen'
brew 'zig'
brew 'zls'
brew 'zstd'
brew 'clojure/tools/clojure'
brew 'pulumi/tap/pulumi'
brew 'svix/svix/svix-cli'
brew 'tw93/tap/mole'

cask '1password'
cask 'alcove'
cask 'android-studio'
cask 'bruno'
cask 'chatgpt'
cask 'claude'
cask 'claude-code'
cask 'codex'
cask 'codex-app'
cask 'cursor'
cask 'dbeaver-community'
cask 'docker-desktop'
cask 'firefox'
cask 'font-iosevka'
cask 'fork'
cask 'gcloud-cli'
cask 'ghostty'
cask 'google-chrome'
cask 'jordanbaird-ice'
cask 'loom'
cask 'mattermost'
cask 'microsoft-auto-update'
cask 'microsoft-excel'
cask 'microsoft-powerpoint'
cask 'microsoft-teams'
cask 'microsoft-word'
cask 'mongodb-compass'
cask 'ngrok'
cask 'obs'
cask 'obsidian'
cask 'pearcleaner'
cask 'pgadmin4'
cask 'raycast'
cask 'sf-symbols'
cask 'slack'
cask 'spotify'
cask 'tailscale-app'
cask 'telegram'
cask 'utm'
cask 'visual-studio-code'
cask 'vlc'
cask 'windows-app'
cask 'xquartz'
cask 'zed'
cask 'zen'
cask 'zoom'

mas "1Password for Safari", id: 1569813296
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "TestFlight", id: 899247664
mas "Xcode", id: 497799835
